Table of Contents
 Class CalculationSetup
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Concrete calculation setup
public class CalculationSetup : OpenObject
Inheritance
object
OpenObject
CalculationSetup
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CalculationSetup()
Constructor
public CalculationSetup()
Properties
 CrossSectionCharacteristics
Cross section charactertistics
public bool CrossSectionCharacteristics { get; set; }
Property Value
bool
 Detailing
Detailing
public bool Detailing { get; set; }
Property Value
bool
 Fatigue
ULS fatigue
public bool Fatigue { get; set; }
Property Value
bool
 MNKappaDiagram
M-N-κ diagram
public bool MNKappaDiagram { get; set; }
Property Value
bool
 SlsCrack
SLS crack
public bool SlsCrack { get; set; }
Property Value
bool
 SlsDeflections
SLS deflections
public bool SlsDeflections { get; set; }
Property Value
bool
 SlsStiffnesses
SLS stiffnesses
public bool SlsStiffnesses { get; set; }
Property Value
bool
 SlsStressLimitation
SLS stress limitation
public bool SlsStressLimitation { get; set; }
Property Value
bool
 UlsDiagram
ULS capacity N-M-M
public bool UlsDiagram { get; set; }
Property Value
bool
 UlsInteraction
Uls interaction
public bool UlsInteraction { get; set; }
Property Value
bool
 UlsResponse
ULS response
public bool UlsResponse { get; set; }
Property Value
bool
 UlsShear
ULS shear
public bool UlsShear { get; set; }
Property Value
bool
 UlsTorsion
ULS torsion
public bool UlsTorsion { get; set; }
Property Value
bool
 Edit this page